# Groupby
- `.groupby` method allow syou to group rows of data together and call aggregate functions

In [4]:
import numpy as np
import pandas as pd

In [5]:
data = {'school': ['HSU', 'HSU','HSU', 'OBU','OBU',
                   'SIU','SIU', 'SEU', 'SEU'],
       'professor': ['Bob','Jeff','Angela','Susan',
                     'Albert','Zelda','Alexa',
                     'Heather','Rebecca'],
       'publication': [10,2,30,25,0,80,4,30,15]}
df = pd.DataFrame(data)

In [6]:
df

  school professor  publication
0    HSU       Bob           10
1    HSU      Jeff            2
2    HSU    Angela           30
3    OBU     Susan           25
4    OBU    Albert            0
5    SIU     Zelda           80
6    SIU     Alexa            4
7    SEU   Heather           30
8    SEU   Rebecca           15

## groupby()
- use the .groupby() method to group rows together based off of a column name
- Create a group based off of school

In [7]:
df.groupby('school') #creates a DataFrameGroupBy object

In [8]:
by_school = df.groupby('school')

## Groupby and Aggregation Methods
- Use the aggregation methods on the grouped object

In [9]:
by_school.mean()

        publication
school
HSU            14.0
OBU            12.5
SEU            22.5
SIU            42.0

In [10]:
df.groupby('school').mean()

        publication
school
HSU            14.0
OBU            12.5
SEU            22.5
SIU            42.0

In [11]:
by_school.std() # standard deviation

        publication
school
HSU       14.422205
OBU       17.677670
SEU       10.606602
SIU       53.740115

In [12]:
by_school.min()

       professor  publication
school
HSU       Angela            2
OBU       Albert            0
SEU      Heather           15
SIU        Alexa            4

In [13]:
by_school.max()

       professor  publication
school
HSU         Jeff           30
OBU        Susan           25
SEU      Rebecca           30
SIU        Zelda           80

In [14]:
by_school.count()

        professor  publication
school
HSU             3            3
OBU             2            2
SEU             2            2
SIU             2            2

## Groupby + describe method

In [15]:
by_school.describe()

       publication
             count  mean        std   min    25%   50%    75%   max
school
HSU            3.0  14.0  14.422205   2.0   6.00  10.0  20.00  30.0
OBU            2.0  12.5  17.677670   0.0   6.25  12.5  18.75  25.0
SEU            2.0  22.5  10.606602  15.0  18.75  22.5  26.25  30.0
SIU            2.0  42.0  53.740115   4.0  23.00  42.0  61.00  80.0

## Groupby + describe method

In [18]:
type(by_school.describe().transpose())

pandas.core.frame.DataFrame

## Groupby + describe method (multiple numeric values)

In [19]:
data = {'school': ['HSU', 'HSU','HSU', 'OBU','OBU','SIU','SIU', 'SEU', 'SEU'],
       'professor': ['Bob','Jeff','Angela','Susan','Albert','Zelda','Alexa','Heather','Rebecca'],
       'publication': [10,2,30,25,0,80,4,30,15],
       'years':[2,8,14,3,4,25,7,2,5]}
df = pd.DataFrame(data)

In [32]:
df.groupby('school').describe()

       publication                                                  years  \
             count  mean        std   min    25%   50%    75%   max count
school
HSU            3.0  14.0  14.422205   2.0   6.00  10.0  20.00  30.0   3.0
OBU            2.0  12.5  17.677670   0.0   6.25  12.5  18.75  25.0   2.0
SEU            2.0  22.5  10.606602  15.0  18.75  22.5  26.25  30.0   2.0
SIU            2.0  42.0  53.740115   4.0  23.00  42.0  61.00  80.0   2.0


        mean        std  min    25%   50%    75%   max
school
HSU      8.0   6.000000  2.0   5.00   8.0  11.00  14.0
OBU      3.5   0.707107  3.0   3.25   3.5   3.75   4.0
SEU      3.5   2.121320  2.0   2.75   3.5   4.25   5.0
SIU     16.0  12.727922  7.0  11.50  16.0  20.50  25.0

In [33]:
df.groupby('school').describe().transpose()

school                   HSU        OBU        SEU        SIU
publication count   3.000000   2.000000   2.000000   2.000000
            mean   14.000000  12.500000  22.500000  42.000000
            std    14.422205  17.677670  10.606602  53.740115
            min     2.000000   0.000000  15.000000   4.000000
            25%     6.000000   6.250000  18.750000  23.000000
            50%    10.000000  12.500000  22.500000  42.000000
            75%    20.000000  18.750000  26.250000  61.000000
            max    30.000000  25.000000  30.000000  80.000000
years       count   3.000000   2.000000   2.000000   2.000000
            mean    8.000000   3.500000   3.500000  16.000000
            std     6.000000   0.707107   2.121320  12.727922
            min     2.000000   3.000000   2.000000   7.000000
            25%     5.000000   3.250000   2.750000  11.500000
            50%     8.000000   3.500000   3.500000  16.000000
            75%    11.000000   3.750000   4.250000  20.500000
            max    14.000000   4.000000   5.000000  25.000000

# DONE